In [5]:
import numpy as np
import pandas as pd

In [6]:
from numpy.random import randn

In [7]:
np.random.seed(101)

In [8]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z'])

In [9]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [14]:
#conditional selection using bracket notation that is similar
booldf = df > 0

In [15]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [16]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [17]:
df[df>0]
#it will return the number that is True from the conditional

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [18]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [20]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
resultdf = df[df['W']>0]

In [27]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [29]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [31]:
df[df['W']>0][['X', 'Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [39]:
boolser = df['W'] > 0
result = df[boolser]
result[['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [38]:
result

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [42]:
#  df[(df['W']>0) and (df['Y'] > 1)]
# this will be an error cuase it is ambiguous becuase and and operation can only take one bool at the same time

In [43]:
df[(df['W']>0) & (df['Y'] > 1)]

# so use the & (ampersand) instead of and as the operator
#intead of or you use the |(pipe operator)

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [45]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [51]:
newind = 'BC AL SA MA ON'.split()

In [52]:
newind

['BC', 'AL', 'SA', 'MA', 'ON']

In [53]:
df['Provinces'] = newind

In [54]:
df

          W         X         Y         Z State Provinces
A  2.706850  0.628133  0.907969  0.503826     C        BC
B  0.651118 -0.319318 -0.848077  0.605965    NY        AL
C -2.018168  0.740122  0.528813 -0.589001    WY        SA
D  0.188695 -0.758872 -0.933237  0.955057    OR        MA
E  0.190794  1.978757  2.605967  0.683509    CO        ON

In [57]:
df.set_index('State')

              W         X         Y         Z Provinces
State
C      2.706850  0.628133  0.907969  0.503826        BC
NY     0.651118 -0.319318 -0.848077  0.605965        AL
WY    -2.018168  0.740122  0.528813 -0.589001        SA
OR     0.188695 -0.758872 -0.933237  0.955057        MA
CO     0.190794  1.978757  2.605967  0.683509        ON

In [58]:
df

          W         X         Y         Z State Provinces
A  2.706850  0.628133  0.907969  0.503826     C        BC
B  0.651118 -0.319318 -0.848077  0.605965    NY        AL
C -2.018168  0.740122  0.528813 -0.589001    WY        SA
D  0.188695 -0.758872 -0.933237  0.955057    OR        MA
E  0.190794  1.978757  2.605967  0.683509    CO        ON

In [60]:
df.drop('State', axis=1,inplace=True)

In [61]:
df

          W         X         Y         Z Provinces
A  2.706850  0.628133  0.907969  0.503826        BC
B  0.651118 -0.319318 -0.848077  0.605965        AL
C -2.018168  0.740122  0.528813 -0.589001        SA
D  0.188695 -0.758872 -0.933237  0.955057        MA
E  0.190794  1.978757  2.605967  0.683509        ON